lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Sensors/ZigbeeHaTemperatureHumiditySensor/ZigbeeHaTemperatureHumiditySensor.ino
  if (aps.profileId == kZigbeeProfileZdo) {
    if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
      delayMicroseconds(kParentRxTurnaroundDelayUs);
      (void)sendApsAcknowledgement(nwk.sourceShort, aps);
    }
    if (duplicateAps) {
      Serial.print("aps_dup cluster=0x");
      Serial.print(aps.clusterId, HEX);
      Serial.print(" src=0x");
      Serial.print(nwk.sourceShort, HEX);
      Serial.print("\r\n");
      return;
    }
    rememberRecentInboundAps(nwk.sourceShort, aps);
    uint16_t responseClusterId = 0U;
    uint8_t responsePayload[127] = {0U};
    uint8_t responseLength = 0U;
    if (g_device.handleZdoRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                  &responseClusterId, responsePayload,
                                  &responseLength) &&
        responseLength > 0U) {
      (void)sendApsFrame(nwk.sourceShort, 0U, responseClusterId,
                         kZigbeeProfileZdo, 0U, responsePayload, responseLength);
      uint8_t leaveFlags = 0U;
      if (g_device.consumeLeaveRequest(&leaveFlags)) {
        handleAcceptedLeaveRequest(leaveFlags);
      }
    }
    return;
  }

  if (aps.profileId != kZigbeeProfileHomeAutomation ||
      aps.destinationEndpoint != kLocalEndpoint) {
    return;
  }
  if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
    delayMicroseconds(kParentRxTurnaroundDelayUs);
    (void)sendApsAcknowledgement(nwk.sourceShort, aps);
  }
  if (duplicateAps) {
    Serial.print("aps_dup cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" src=0x");
    Serial.print(nwk.sourceShort, HEX);
    Serial.print("\r\n");
    return;
  }
  rememberRecentInboundAps(nwk.sourceShort, aps);

  uint8_t responseFrame[127] = {0U};
  uint8_t responseLength = 0U;
  if (!g_device.handleZclRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                 responseFrame, &responseLength)) {
    return;
  }

  persistState();
  Serial.print("zcl cluster=0x");
  Serial.print(aps.clusterId, HEX);
  Serial.print("\r\n");
  if (responseLength > 0U) {
    delayMicroseconds(kParentRxTurnaroundDelayUs);
    (void)sendApsFrame(nwk.sourceShort, aps.sourceEndpoint, aps.clusterId,
                       aps.profileId, aps.destinationEndpoint, responseFrame,
                       responseLength);
  }
}

void pollCoordinator() {
  refreshCommissioningState();
  if (!ZigbeeCommissioning::shouldPollParent(g_network)) {
    return;
  }

  uint8_t request[127] = {0U};
  uint8_t requestLength = 0U;
  const bool joinedPoll =
      ZigbeeCommissioning::selectShortSourceParentPoll(&g_network);
  const bool built =
      joinedPoll
          ? ZigbeeCodec::buildDataRequestShort(g_macSequence++, g_panId,
                                               g_parentShort, g_localShort,
                                               request, &requestLength)
          : ZigbeeCodec::buildDataRequest(g_macSequence++, g_panId,
                                          g_parentShort, kIeeeAddress, request,
                                          &requestLength);
  if (!built) {
    return;
  }
  ZigbeeFrame frame{};
  if (g_radio.transmitThenReceive(request, requestLength, &frame, 12000U, false,
                                  1200000UL)) {
    processIncomingFrame(frame);
  }

  const uint32_t followupWindowStartUs = micros();
  while (static_cast<uint32_t>(micros() - followupWindowStartUs) <
         static_cast<uint32_t>(
             NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US)) {
    const uint32_t elapsedUs =
        static_cast<uint32_t>(micros() - followupWindowStartUs);
    const uint32_t remainingUs =
        (elapsedUs <
         static_cast<uint32_t>(
             NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US))
            ? (static_cast<uint32_t>(
                   NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US) -
               elapsedUs)
            : 0U;
    if (remainingUs == 0U) {
      break;
    }
    if (!g_radio.receive(&frame, remainingUs, 350000UL)) {
      continue;
    }
    processIncomingFrame(frame);
  }
}

void maybeSendScheduledReports(uint32_t nowMs) {
  if (!g_joined) {
    return;
  }

  while (sendDueAttributeReport(nowMs, nullptr)) {
  }
}

void maybeSendBootReports(uint32_t nowMs) {
  if (!g_joined || !g_bootReportsPending) {
    return;
  }
  if ((nowMs - g_bootMs) <
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_BOOT_REPORT_DELAY_MS)) {
    return;
  }

  const bool tempOk = sendAttributeReport(kZigbeeClusterTemperatureMeasurement);
  const bool powerOk = sendAttributeReport(kZigbeeClusterPowerConfiguration);
  g_bootReportsPending = false;
  Serial.print("boot_report temp=");
  Serial.print(tempOk ? "OK" : "FAIL");
  Serial.print(" power=");
  Serial.print(powerOk ? "OK" : "FAIL");
  Serial.print("\r\n");
}

void maybeEnterLowPowerCycle(uint32_t nowMs) {
  if (!lowPowerCycleEnabled() || !g_joined || g_bootReportsPending ||
      hasPendingApsAcks() || g_device.identifying()) {
    return;
  }
  if ((nowMs - g_bootMs) <
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_LOW_POWER_WAKE_WINDOW_MS)) {
    return;
  }

  Serial.print("sleep_cycle system_off_ms=");
  Serial.print(static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_LOW_POWER_SLEEP_MS));
  Serial.print("\r\n");
  delay(20);
  delaySystemOffNoRetention(
      static_cast<unsigned long>(NRF54L15_CLEAN_ZIGBEE_LOW_POWER_SLEEP_MS));
}

void handleSerialCommands() {
  while (Serial.available() > 0) {
    const int ch = Serial.read();
    if ((!g_persistentSecurityReady || !g_radioReady) && ch != 'c' &&
        ch != 's') {
      if (ch != '\r' && ch != '\n') {
        Serial.print("persistence blocked; use c to clear or s for status\r\n");
      }
      continue;
    }
    if (ch == 'r') {
      const bool tempOk = sendAttributeReport(kZigbeeClusterTemperatureMeasurement);
      const bool powerOk = sendAttributeReport(kZigbeeClusterPowerConfiguration);
      Serial.print("report temp=");
      Serial.print(tempOk ? "OK" : "FAIL");
      Serial.print(" power=");
      Serial.print(powerOk ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'j') {
      const ZigbeeCommissioningStartRequest request =
          requestCommissioningStart();
      if (request == ZigbeeCommissioningStartRequest::kSecureRejoin) {
        Serial.print("secure_rejoin requested\r\n");
      } else if (request ==
                 ZigbeeCommissioningStartRequest::kNetworkSteering) {
        Serial.print("network_steering requested\r\n");
      } else {
        Serial.print("commissioning request ignored\r\n");
      }
    } else if (ch == 'c') {
      const bool cleared = clearJoinState(true);
      Serial.print(cleared ? "state cleared\r\n"
                           : "state clear failed\r\n");
    } else if (ch == 's') {
      Serial.print("state joined=");
      Serial.print(g_joined ? "yes" : "no");
      Serial.print(" mode=");
      Serial.print(ZigbeeCommissioning::stateName(g_network.state));
      Serial.print(" failure=");
      Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
      Serial.print(" join_attempts=");
      Serial.print(g_network.joinAttempts);
      Serial.print(" rejoin_attempts=");
      Serial.print(g_network.rejoinAttempts);
      Serial.print(" ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print(" nwk_seq=");
      Serial.print(g_haveActiveNetworkKey ? g_activeNetworkKeySequence : 0U);
      Serial.print(" alt_seq=");
      Serial.print(g_haveAlternateNetworkKey ? g_alternateNetworkKeySequence
                                             : 0U);
      Serial.print(" poll_ms=");
      Serial.print(g_parentPollIntervalMs);
      Serial.print(" reports=");
      Serial.print(g_device.reportingConfigurationCount());
      Serial.print("\r\n");
    }
  }
}

}  // namespace

void setup() {
  g_bootMs = millis();
  g_bootReportsPending = true;
  Serial.begin(115200);
  delay(300);

  if (g_localIeee == 0U) {
    g_localIeee = zigbeeFactoryEui64();
  }

